{"class_name": "Tokenizer", "config": {"num_words": 20000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 222, "word_counts": "{\"package\": 222, \"juliet\": 444, \"testcases\": 222, \"cwe89\": 540, \"sql\": 720, \"injection\": 612, \"s04\": 36, \"import\": 804, \"support\": 222, \"javax\": 222, \"servlet\": 372, \"http\": 222, \"java\": 360, \"util\": 180, \"logging\": 180, \"level\": 756, \"public\": 444, \"class\": 222, \"property\": 34, \"executeupdate\": 108, \"81\": 444, \"goodg2b\": 81, \"extends\": 222, \"base\": 222, \"void\": 222, \"action\": 222, \"string\": 282, \"data\": 642, \"throws\": 222, \"throwable\": 222, \"connection\": 540, \"dbconnection\": 900, \"null\": 846, \"statement\": 168, \"sqlstatement\": 996, \"try\": 576, \"io\": 1008, \"getdbconnection\": 180, \"createstatement\": 96, \"int\": 180, \"rowcount\": 72, \"insert\": 108, \"into\": 108, \"users\": 180, \"status\": 108, \"values\": 108, \"'updated'\": 108, \"where\": 180, \"name\": 276, \"'\": 240, \"writeline\": 252, \"updated\": 108, \"rows\": 36, \"successfully\": 108, \"catch\": 576, \"sqlexception\": 576, \"exceptsql\": 1152, \"logger\": 576, \"log\": 576, \"warning\": 576, \"error\": 576, \"getting\": 180, \"database\": 218, \"finally\": 180, \"if\": 582, \"close\": 396, \"closing\": 396, \"s01\": 48, \"connect\": 38, \"tcp\": 76, \"urlconnection\": 38, \"preparestatement\": 156, \"goodb2g\": 60, \"preparedstatement\": 168, \"setstring\": 60, \"1\": 96, \"boolean\": 72, \"result\": 144, \"execute\": 144, \"else\": 96, \"unable\": 72, \"to\": 72, \"update\": 108, \"records\": 72, \"for\": 144, \"user\": 72, \"cwe78\": 72, \"os\": 96, \"command\": 72, \"getparameter\": 38, \"httpservletrequest\": 69, \"request\": 69, \"httpservletresponse\": 69, \"response\": 87, \"oscommand\": 96, \"system\": 24, \"getproperty\": 24, \"tolowercase\": 24, \"indexof\": 24, \"win\": 24, \"0\": 168, \"c\": 48, \"windows\": 24, \"system32\": 24, \"cmd\": 24, \"exe\": 24, \"dir\": 24, \"bin\": 24, \"ls\": 24, \"process\": 72, \"runtime\": 24, \"getruntime\": 24, \"exec\": 24, \"waitfor\": 24, \"s02\": 48, \"file\": 38, \"console\": 34, \"readline\": 34, \"executequery\": 108, \"resultset\": 252, \"select\": 36, \"from\": 36, \"getrow\": 36, \"getcookies\": 38, \"executebatch\": 108, \"names\": 180, \"split\": 36, \"successcount\": 108, \"set\": 36, \"hitcount\": 72, \"i\": 288, \"length\": 108, \"addbatch\": 36, \"resultsarray\": 72, \"succeeded\": 36, \"in\": 36, \"out\": 36, \"of\": 36, \"queries\": 36, \"s03\": 48, \"listen\": 38, \"statament\": 24, \"getquerystring\": 38, \"environment\": 34, \"propertiesfile\": 38, \"cwe83\": 54, \"xss\": 54, \"attribute\": 54, \"getwriter\": 18, \"println\": 18, \"br\": 18, \"bad\": 99, \"img\": 18, \"src\": 18}", "word_docs": "{\"createstatement\": 96, \"log\": 180, \"java\": 180, \"logger\": 180, \"public\": 222, \"package\": 222, \"void\": 222, \"cwe89\": 180, \"rowcount\": 36, \"error\": 180, \"testcases\": 222, \"level\": 180, \"executeupdate\": 36, \"injection\": 204, \"extends\": 222, \"if\": 222, \"throwable\": 222, \"warning\": 180, \"catch\": 180, \"users\": 180, \"s04\": 36, \"close\": 180, \"'updated'\": 108, \"getting\": 180, \"exceptsql\": 180, \"base\": 222, \"finally\": 180, \"sqlstatement\": 180, \"sqlexception\": 180, \"goodg2b\": 81, \"successfully\": 108, \"support\": 222, \"null\": 198, \"juliet\": 222, \"import\": 222, \"string\": 222, \"getdbconnection\": 180, \"updated\": 108, \"servlet\": 222, \"try\": 180, \"throws\": 222, \"logging\": 180, \"81\": 222, \"property\": 17, \"class\": 222, \"where\": 180, \"dbconnection\": 180, \"statement\": 96, \"javax\": 222, \"status\": 108, \"http\": 222, \"connection\": 180, \"name\": 204, \"insert\": 108, \"closing\": 180, \"data\": 222, \"values\": 108, \"int\": 72, \"io\": 180, \"'\": 120, \"writeline\": 180, \"rows\": 36, \"sql\": 180, \"database\": 184, \"action\": 222, \"into\": 108, \"util\": 180, \"s01\": 48, \"tcp\": 38, \"connect\": 19, \"update\": 108, \"1\": 84, \"preparedstatement\": 84, \"result\": 72, \"setstring\": 60, \"urlconnection\": 19, \"preparestatement\": 84, \"to\": 72, \"records\": 72, \"goodb2g\": 60, \"boolean\": 72, \"for\": 108, \"else\": 96, \"execute\": 72, \"user\": 72, \"unable\": 72, \"win\": 24, \"c\": 24, \"request\": 69, \"httpservletresponse\": 69, \"waitfor\": 24, \"httpservletrequest\": 69, \"getparameter\": 19, \"indexof\": 24, \"0\": 60, \"runtime\": 24, \"getruntime\": 24, \"dir\": 24, \"exec\": 24, \"process\": 24, \"cmd\": 24, \"tolowercase\": 24, \"system32\": 24, \"windows\": 24, \"ls\": 24, \"response\": 69, \"cwe78\": 24, \"command\": 24, \"bin\": 24, \"getproperty\": 24, \"os\": 24, \"system\": 24, \"oscommand\": 24, \"exe\": 24, \"s02\": 48, \"file\": 19, \"readline\": 17, \"console\": 17, \"select\": 36, \"getrow\": 36, \"executequery\": 36, \"from\": 36, \"resultset\": 36, \"set\": 36, \"out\": 36, \"split\": 36, \"executebatch\": 36, \"getcookies\": 19, \"in\": 36, \"hitcount\": 36, \"successcount\": 36, \"names\": 36, \"resultsarray\": 36, \"of\": 36, \"i\": 36, \"succeeded\": 36, \"length\": 36, \"queries\": 36, \"addbatch\": 36, \"s03\": 48, \"listen\": 19, \"statament\": 24, \"getquerystring\": 19, \"environment\": 17, \"propertiesfile\": 19, \"img\": 18, \"getwriter\": 18, \"println\": 18, \"xss\": 18, \"bad\": 90, \"attribute\": 18, \"src\": 18, \"cwe83\": 18, \"br\": 18}", "index_docs": "{\"78\": 96, \"17\": 180, \"28\": 180, \"16\": 180, \"23\": 222, \"35\": 222, \"43\": 222, \"20\": 180, \"86\": 36, \"19\": 180, \"36\": 222, \"8\": 180, \"64\": 36, \"11\": 204, \"41\": 222, \"12\": 222, \"46\": 222, \"18\": 180, \"14\": 180, \"52\": 180, \"117\": 36, \"25\": 180, \"69\": 108, \"54\": 180, \"2\": 180, \"42\": 222, \"55\": 180, \"4\": 180, \"15\": 180, \"84\": 81, \"71\": 108, \"37\": 222, \"6\": 198, \"22\": 222, \"7\": 222, \"30\": 222, \"50\": 180, \"70\": 108, \"27\": 222, \"13\": 180, \"45\": 222, \"49\": 180, \"24\": 222, \"130\": 17, \"40\": 222, \"53\": 180, \"5\": 180, \"57\": 96, \"38\": 222, \"67\": 108, \"39\": 222, \"21\": 180, \"31\": 204, \"65\": 108, \"26\": 180, \"10\": 222, \"68\": 108, \"51\": 72, \"3\": 180, \"34\": 120, \"32\": 180, \"118\": 36, \"9\": 180, \"47\": 184, \"44\": 222, \"66\": 108, \"48\": 180, \"105\": 48, \"85\": 38, \"109\": 19, \"72\": 108, \"79\": 84, \"58\": 84, \"61\": 72, \"101\": 60, \"110\": 19, \"60\": 84, \"89\": 72, \"90\": 72, \"100\": 60, \"87\": 72, \"63\": 108, \"80\": 96, \"62\": 72, \"91\": 72, \"88\": 72, \"138\": 24, \"106\": 24, \"98\": 69, \"99\": 69, \"149\": 24, \"97\": 69, \"111\": 19, \"137\": 24, \"59\": 60, \"146\": 24, \"147\": 24, \"143\": 24, \"148\": 24, \"94\": 24, \"141\": 24, \"136\": 24, \"140\": 24, \"139\": 24, \"145\": 24, \"83\": 69, \"92\": 24, \"93\": 24, \"144\": 24, \"135\": 24, \"81\": 24, \"134\": 24, \"82\": 24, \"142\": 24, \"107\": 48, \"112\": 19, \"132\": 17, \"131\": 17, \"119\": 36, \"121\": 36, \"73\": 36, \"120\": 36, \"33\": 36, \"123\": 36, \"127\": 36, \"122\": 36, \"74\": 36, \"113\": 19, \"126\": 36, \"95\": 36, \"75\": 36, \"56\": 36, \"96\": 36, \"128\": 36, \"29\": 36, \"125\": 36, \"76\": 36, \"129\": 36, \"124\": 36, \"108\": 48, \"114\": 19, \"150\": 24, \"115\": 19, \"133\": 17, \"116\": 19, \"154\": 18, \"151\": 18, \"152\": 18, \"103\": 18, \"77\": 90, \"104\": 18, \"155\": 18, \"102\": 18, \"153\": 18}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"exceptsql\", \"3\": \"io\", \"4\": \"sqlstatement\", \"5\": \"dbconnection\", \"6\": \"null\", \"7\": \"import\", \"8\": \"level\", \"9\": \"sql\", \"10\": \"data\", \"11\": \"injection\", \"12\": \"if\", \"13\": \"try\", \"14\": \"catch\", \"15\": \"sqlexception\", \"16\": \"logger\", \"17\": \"log\", \"18\": \"warning\", \"19\": \"error\", \"20\": \"cwe89\", \"21\": \"connection\", \"22\": \"juliet\", \"23\": \"public\", \"24\": \"81\", \"25\": \"close\", \"26\": \"closing\", \"27\": \"servlet\", \"28\": \"java\", \"29\": \"i\", \"30\": \"string\", \"31\": \"name\", \"32\": \"writeline\", \"33\": \"resultset\", \"34\": \"'\", \"35\": \"package\", \"36\": \"testcases\", \"37\": \"support\", \"38\": \"javax\", \"39\": \"http\", \"40\": \"class\", \"41\": \"extends\", \"42\": \"base\", \"43\": \"void\", \"44\": \"action\", \"45\": \"throws\", \"46\": \"throwable\", \"47\": \"database\", \"48\": \"util\", \"49\": \"logging\", \"50\": \"getdbconnection\", \"51\": \"int\", \"52\": \"users\", \"53\": \"where\", \"54\": \"getting\", \"55\": \"finally\", \"56\": \"names\", \"57\": \"statement\", \"58\": \"preparedstatement\", \"59\": \"0\", \"60\": \"preparestatement\", \"61\": \"result\", \"62\": \"execute\", \"63\": \"for\", \"64\": \"executeupdate\", \"65\": \"insert\", \"66\": \"into\", \"67\": \"status\", \"68\": \"values\", \"69\": \"'updated'\", \"70\": \"updated\", \"71\": \"successfully\", \"72\": \"update\", \"73\": \"executequery\", \"74\": \"executebatch\", \"75\": \"successcount\", \"76\": \"length\", \"77\": \"bad\", \"78\": \"createstatement\", \"79\": \"1\", \"80\": \"else\", \"81\": \"os\", \"82\": \"oscommand\", \"83\": \"response\", \"84\": \"goodg2b\", \"85\": \"tcp\", \"86\": \"rowcount\", \"87\": \"boolean\", \"88\": \"unable\", \"89\": \"to\", \"90\": \"records\", \"91\": \"user\", \"92\": \"cwe78\", \"93\": \"command\", \"94\": \"process\", \"95\": \"hitcount\", \"96\": \"resultsarray\", \"97\": \"httpservletrequest\", \"98\": \"request\", \"99\": \"httpservletresponse\", \"100\": \"goodb2g\", \"101\": \"setstring\", \"102\": \"cwe83\", \"103\": \"xss\", \"104\": \"attribute\", \"105\": \"s01\", \"106\": \"c\", \"107\": \"s02\", \"108\": \"s03\", \"109\": \"connect\", \"110\": \"urlconnection\", \"111\": \"getparameter\", \"112\": \"file\", \"113\": \"getcookies\", \"114\": \"listen\", \"115\": \"getquerystring\", \"116\": \"propertiesfile\", \"117\": \"s04\", \"118\": \"rows\", \"119\": \"select\", \"120\": \"from\", \"121\": \"getrow\", \"122\": \"split\", \"123\": \"set\", \"124\": \"addbatch\", \"125\": \"succeeded\", \"126\": \"in\", \"127\": \"out\", \"128\": \"of\", \"129\": \"queries\", \"130\": \"property\", \"131\": \"console\", \"132\": \"readline\", \"133\": \"environment\", \"134\": \"system\", \"135\": \"getproperty\", \"136\": \"tolowercase\", \"137\": \"indexof\", \"138\": \"win\", \"139\": \"windows\", \"140\": \"system32\", \"141\": \"cmd\", \"142\": \"exe\", \"143\": \"dir\", \"144\": \"bin\", \"145\": \"ls\", \"146\": \"runtime\", \"147\": \"getruntime\", \"148\": \"exec\", \"149\": \"waitfor\", \"150\": \"statament\", \"151\": \"getwriter\", \"152\": \"println\", \"153\": \"br\", \"154\": \"img\", \"155\": \"src\"}", "word_index": "{\"<OOV>\": 1, \"exceptsql\": 2, \"io\": 3, \"sqlstatement\": 4, \"dbconnection\": 5, \"null\": 6, \"import\": 7, \"level\": 8, \"sql\": 9, \"data\": 10, \"injection\": 11, \"if\": 12, \"try\": 13, \"catch\": 14, \"sqlexception\": 15, \"logger\": 16, \"log\": 17, \"warning\": 18, \"error\": 19, \"cwe89\": 20, \"connection\": 21, \"juliet\": 22, \"public\": 23, \"81\": 24, \"close\": 25, \"closing\": 26, \"servlet\": 27, \"java\": 28, \"i\": 29, \"string\": 30, \"name\": 31, \"writeline\": 32, \"resultset\": 33, \"'\": 34, \"package\": 35, \"testcases\": 36, \"support\": 37, \"javax\": 38, \"http\": 39, \"class\": 40, \"extends\": 41, \"base\": 42, \"void\": 43, \"action\": 44, \"throws\": 45, \"throwable\": 46, \"database\": 47, \"util\": 48, \"logging\": 49, \"getdbconnection\": 50, \"int\": 51, \"users\": 52, \"where\": 53, \"getting\": 54, \"finally\": 55, \"names\": 56, \"statement\": 57, \"preparedstatement\": 58, \"0\": 59, \"preparestatement\": 60, \"result\": 61, \"execute\": 62, \"for\": 63, \"executeupdate\": 64, \"insert\": 65, \"into\": 66, \"status\": 67, \"values\": 68, \"'updated'\": 69, \"updated\": 70, \"successfully\": 71, \"update\": 72, \"executequery\": 73, \"executebatch\": 74, \"successcount\": 75, \"length\": 76, \"bad\": 77, \"createstatement\": 78, \"1\": 79, \"else\": 80, \"os\": 81, \"oscommand\": 82, \"response\": 83, \"goodg2b\": 84, \"tcp\": 85, \"rowcount\": 86, \"boolean\": 87, \"unable\": 88, \"to\": 89, \"records\": 90, \"user\": 91, \"cwe78\": 92, \"command\": 93, \"process\": 94, \"hitcount\": 95, \"resultsarray\": 96, \"httpservletrequest\": 97, \"request\": 98, \"httpservletresponse\": 99, \"goodb2g\": 100, \"setstring\": 101, \"cwe83\": 102, \"xss\": 103, \"attribute\": 104, \"s01\": 105, \"c\": 106, \"s02\": 107, \"s03\": 108, \"connect\": 109, \"urlconnection\": 110, \"getparameter\": 111, \"file\": 112, \"getcookies\": 113, \"listen\": 114, \"getquerystring\": 115, \"propertiesfile\": 116, \"s04\": 117, \"rows\": 118, \"select\": 119, \"from\": 120, \"getrow\": 121, \"split\": 122, \"set\": 123, \"addbatch\": 124, \"succeeded\": 125, \"in\": 126, \"out\": 127, \"of\": 128, \"queries\": 129, \"property\": 130, \"console\": 131, \"readline\": 132, \"environment\": 133, \"system\": 134, \"getproperty\": 135, \"tolowercase\": 136, \"indexof\": 137, \"win\": 138, \"windows\": 139, \"system32\": 140, \"cmd\": 141, \"exe\": 142, \"dir\": 143, \"bin\": 144, \"ls\": 145, \"runtime\": 146, \"getruntime\": 147, \"exec\": 148, \"waitfor\": 149, \"statament\": 150, \"getwriter\": 151, \"println\": 152, \"br\": 153, \"img\": 154, \"src\": 155}"}}